OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf13k50.h
extern __at(0x0FB7) volatile __PWM1CONbits_t PWM1CONbits;

#define _PDC0                   0x01
#define _PDC1                   0x02
#define _PDC2                   0x04
#define _PDC3                   0x08
#define _PDC4                   0x10
#define _PDC5                   0x20
#define _PDC6                   0x40
#define _PRSEN                  0x80

//==============================================================================


//==============================================================================
//        BAUDCON Bits

extern __at(0x0FB8) __sfr BAUDCON;

typedef union
  {
  struct
    {
    unsigned ABDEN              : 1;
    unsigned WUE                : 1;
    unsigned                    : 1;
    unsigned BRG16              : 1;
    unsigned CKTXP              : 1;
    unsigned DTRXP              : 1;
    unsigned RCIDL              : 1;
    unsigned ABDOVF             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SCKP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __BAUDCONbits_t;

extern __at(0x0FB8) volatile __BAUDCONbits_t BAUDCONbits;

#define _ABDEN                  0x01
#define _WUE                    0x02
#define _BRG16                  0x08
#define _CKTXP                  0x10
#define _SCKP                   0x10
#define _DTRXP                  0x20
#define _RCIDL                  0x40
#define _ABDOVF                 0x80

//==============================================================================


//==============================================================================
//        BAUDCTL Bits

extern __at(0x0FB8) __sfr BAUDCTL;

typedef union
  {
  struct
    {
    unsigned ABDEN              : 1;
    unsigned WUE                : 1;
    unsigned                    : 1;
    unsigned BRG16              : 1;
    unsigned CKTXP              : 1;
    unsigned DTRXP              : 1;
    unsigned RCIDL              : 1;
    unsigned ABDOVF             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SCKP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __BAUDCTLbits_t;

extern __at(0x0FB8) volatile __BAUDCTLbits_t BAUDCTLbits;

#define _BAUDCTL_ABDEN          0x01
#define _BAUDCTL_WUE            0x02
#define _BAUDCTL_BRG16          0x08
#define _BAUDCTL_CKTXP          0x10
#define _BAUDCTL_SCKP           0x10
#define _BAUDCTL_DTRXP          0x20
#define _BAUDCTL_RCIDL          0x40
#define _BAUDCTL_ABDOVF         0x80

//==============================================================================


//==============================================================================
//        PSTRCON Bits

extern __at(0x0FB9) __sfr PSTRCON;

typedef struct
  {
  unsigned STRA                 : 1;
  unsigned STRB                 : 1;
  unsigned STRC                 : 1;
  unsigned STRD                 : 1;
  unsigned STRSYNC              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSTRCONbits_t;

extern __at(0x0FB9) volatile __PSTRCONbits_t PSTRCONbits;

#define _STRA                   0x01
#define _STRB                   0x02
#define _STRC                   0x04
#define _STRD                   0x08
#define _STRSYNC                0x10

//==============================================================================


//==============================================================================
//        REFCON0 Bits

extern __at(0x0FBA) __sfr REFCON0;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned FVR1S0             : 1;
    unsigned FVR1S1             : 1;
    unsigned FVR1ST             : 1;
    unsigned FVR1EN             : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned FVR1S              : 2;
    unsigned                    : 2;
    };
  } __REFCON0bits_t;

extern __at(0x0FBA) volatile __REFCON0bits_t REFCON0bits;

#define _FVR1S0                 0x10
#define _FVR1S1                 0x20
#define _FVR1ST                 0x40
#define _FVR1EN                 0x80

//==============================================================================


//==============================================================================
//        VREFCON0 Bits

extern __at(0x0FBA) __sfr VREFCON0;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned FVR1S0             : 1;
    unsigned FVR1S1             : 1;
    unsigned FVR1ST             : 1;
    unsigned FVR1EN             : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned FVR1S              : 2;
    unsigned                    : 2;
    };
  } __VREFCON0bits_t;

extern __at(0x0FBA) volatile __VREFCON0bits_t VREFCON0bits;

#define _VREFCON0_FVR1S0        0x10
#define _VREFCON0_FVR1S1        0x20
#define _VREFCON0_FVR1ST        0x40
#define _VREFCON0_FVR1EN        0x80

//==============================================================================


//==============================================================================
//        REFCON1 Bits

extern __at(0x0FBB) __sfr REFCON1;

typedef union
  {
  struct
    {
    unsigned D1NSS              : 1;
    unsigned                    : 1;
    unsigned D1PSS0             : 1;
    unsigned D1PSS1             : 1;
    unsigned                    : 1;
    unsigned DAC1OE             : 1;
    unsigned D1LPS              : 1;
    unsigned D1EN               : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned D1PSS              : 2;
    unsigned                    : 4;
    };
  } __REFCON1bits_t;

extern __at(0x0FBB) volatile __REFCON1bits_t REFCON1bits;

#define _D1NSS                  0x01
#define _D1PSS0                 0x04
#define _D1PSS1                 0x08
#define _DAC1OE                 0x20
#define _D1LPS                  0x40
#define _D1EN                   0x80

//==============================================================================


//==============================================================================
//        VREFCON1 Bits

extern __at(0x0FBB) __sfr VREFCON1;

typedef union
  {
  struct
    {
    unsigned D1NSS              : 1;
    unsigned                    : 1;
    unsigned D1PSS0             : 1;
    unsigned D1PSS1             : 1;
    unsigned                    : 1;
    unsigned DAC1OE             : 1;
    unsigned D1LPS              : 1;
    unsigned D1EN               : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned D1PSS              : 2;
    unsigned                    : 4;
    };
  } __VREFCON1bits_t;

extern __at(0x0FBB) volatile __VREFCON1bits_t VREFCON1bits;

